type Kana = {
	basic: Record<string, string>,
	voiced: Record<string, string>,
	contracted: Record<string, string>,
}

export const hiragana: Kana = {
	basic: {
		'a': 'あ', 'i': 'い', 'u': 'う', 'e': 'え', 'o': 'お',
		'ka': 'か', 'ki': 'き', 'ku': 'く', 'ke': 'け', 'ko': 'こ',
		'sa': 'さ', 'shi': 'し', 'su': 'す', 'se': 'せ', 'so': 'そ',
		'ta': 'た', 'chi': 'ち', 'tsu': 'つ', 'te': 'て', 'to': 'と',
		'na': 'な', 'ni': 'に', 'nu': 'ぬ', 'ne': 'ね', 'no': 'の',
		'ha': 'は', 'hi': 'ひ', 'fu': 'ふ', 'he': 'へ', 'ho': 'ほ',
		'ma': 'ま', 'mi': 'み', 'mu': 'む', 'me': 'め', 'mo': 'も',
		'ya': 'や', 'yu': 'ゆ', 'yo': 'よ', 'ra': 'ら', 'ri': 'り',
		'ru': 'る', 're': 'れ', 'ro': 'ろ', 'wa': 'わ', 'wo': 'を',
		'n': 'ん'
	},
	voiced: {
		'ga': 'が', 'gi': 'ぎ', 'gu': 'ぐ', 'ge': 'げ', 'go': 'ご',
		'za': 'ざ', 'ji': 'じ', 'zu': 'ず', 'ze': 'ぜ', 'zo': 'ぞ',
		'da': 'だ', 'ji*': 'ぢ', 'zu*': 'づ', 'de': 'で', 'do': 'ど',
		'ba': 'ば', 'bi': 'び', 'bu': 'ぶ', 'be': 'べ', 'bo': 'ぼ',
		'pa': 'ぱ', 'pi': 'ぴ', 'pu': 'ぷ', 'pe': 'ぺ', 'po': 'ぽ'
	},
	contracted: {
		'gya': 'ぎゃ', 'gyu': 'ぎゅ', 'gyo': 'ぎょ',
		'ja': 'じゃ', 'ju': 'じゅ', 'jo': 'じょ',
		'ja*': 'ぢゃ', 'ju*': 'ぢゅ', 'jo*': 'ぢょ',
		'bya': 'びゃ', 'byu': 'びゅ', 'byo': 'びょ',
		'pya': 'ぴゃ', 'pyu': 'ぴゅ', 'pyo': 'ぴょ'
	}
};

export const katakana: Kana = {
	basic: {
		'a': 'ア', 'i': 'イ', 'u': 'ウ', 'e': 'エ', 'o': 'オ',
		'ka': 'カ', 'ki': 'キ', 'ku': 'ク', 'ke': 'ケ', 'ko': 'コ',
		'sa': 'サ', 'shi': 'シ', 'su': 'ス', 'se': 'セ', 'so': 'ソ',
		'ta': 'タ', 'chi': 'チ', 'tsu': 'ツ', 'te': 'テ', 'to': 'ト',
		'na': 'ナ', 'ni': 'ニ', 'nu': 'ヌ', 'ne': 'ネ', 'no': 'ノ',
		'ha': 'ハ', 'hi': 'ヒ', 'fu': 'フ', 'he': 'ヘ', 'ho': 'ホ',
		'ma': 'マ', 'mi': 'ミ', 'mu': 'ム', 'me': 'メ', 'mo': 'モ',
		'ya': 'ヤ', 'yu': 'ユ', 'yo': 'ヨ', 'ra': 'ラ', 'ri': 'リ',
		'ru': 'ル', 're': 'レ', 'ro': 'ロ', 'wa': 'ワ', 'wo': 'ヲ',
		'n': 'ン'
	},
	voiced: {
		'ga': 'ガ', 'gi': 'ギ', 'gu': 'グ', 'ge': 'ゲ', 'go': 'ゴ',
		'za': 'ザ', 'ji': 'ジ', 'zu': 'ズ', 'ze': 'ゼ', 'zo': 'ゾ',
		'da': 'ダ', 'ji*': 'ヂ', 'zu*': 'ヅ', 'de': 'デ', 'do': 'ド',
		'ba': 'バ', 'bi': 'ビ', 'bu': 'ブ', 'be': 'ベ', 'bo': 'ボ',
		'pa': 'パ', 'pi': 'ピ', 'pu': 'プ', 'pe': 'ペ', 'po': 'ポ'
	},
	contracted: {
		'gya': 'ギャ', 'gyu': 'ギュ', 'gyo': 'ギョ',
		'ja': 'ジャ', 'ju': 'ジュ', 'jo': 'ジョ',
		'ja*': 'ヂャ', 'ju*': 'ヂュ', 'jo*': 'ヂョ',
		'bya': 'ビャ', 'byu': 'ビュ', 'byo': 'ビョ',
		'pya': 'ピャ', 'pyu': 'ピュ', 'pyo': 'ピョ'
	}
};